analogdevicesinc/MAX78xxx-RefDes/maxrefdes178/maxrefdes178_max32666/src/max32666_pmic.c
/*******************************************************************************
 * Copyright (C) Maxim Integrated Products, Inc., All rights Reserved.
 *
 * This software is protected by copyright laws of the United States and
 * of foreign countries. This material may also be protected by patent laws
 * and technology transfer regulations of the United States and of foreign
 * countries. This software is furnished under a license agreement and/or a
 * nondisclosure agreement and may only be used or reproduced in accordance
 * with the terms of those agreements. Dissemination of this information to
 * any party or parties not specified in the license agreement and/or
 * nondisclosure agreement is expressly prohibited.
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *******************************************************************************
 */

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <mxc_delay.h>
#include <mxc_errors.h>
#include <stdio.h>

#include "max32666_debug.h"
#include "max32666_data.h"
#include "max32666_i2c.h"
#include "max32666_pmic.h"


//-----------------------------------------------------------------------------
// Defines
//-----------------------------------------------------------------------------
#define S_MODULE_NAME   "pmic"

//// MAX20303 PMIC Definitions
// MAX20303 Device ID register value
#define MAX20303_HARDWARE_ID             0x02

// MAX20303 PMIC Registers
#define MAX20303_REG_HARDWARE_ID         0x00     // HardwareID Register
#define MAX20303_REG_FIRMWARE_REV        0x01     // FirmwareID Register
#define MAX20303_REG_INT0                0x03     // Int0 Register
#define MAX20303_REG_INT1                0x04     // Int1 Register
#define MAX20303_REG_INT2                0x05     // Int2 Register
#define MAX20303_REG_STATUS0             0x06     // Status Register 0
#define MAX20303_REG_STATUS1             0x07     // Status Register 1
#define MAX20303_REG_STATUS2             0x08     // Status Register 2
#define MAX20303_REG_STATUS3             0x09     // Status Register 2
#define MAX20303_REG_SYSTEM_ERROR        0x0B     // SystemError Register
#define MAX20303_REG_INT_MASK0           0x0C     // IntMask0 Register
#define MAX20303_REG_INT_MASK1           0x0D     // IntMask1 Register
#define MAX20303_REG_INT_MASK2           0x0E     // IntMask1 Register
#define MAX20303_REG_AP_DATOUT0          0x0F     // APDataOut0 Register
#define MAX20303_REG_AP_DATOUT1          0x10     // APDataOut1 Register
#define MAX20303_REG_AP_DATOUT2          0x11     // APDataOut2 Register
#define MAX20303_REG_AP_DATOUT3          0x12     // APDataOut3 Register
#define MAX20303_REG_AP_DATOUT4          0x13     // APDataOut4 Register
#define MAX20303_REG_AP_DATOUT5          0x14     // APDataOut5 Register
#define MAX20303_REG_AP_DATOUT6          0x15     // APDataOut6 Register
#define MAX20303_REG_AP_CMDOUT           0x17     // APCmdOut Register
#define MAX20303_REG_AP_RESPONSE         0x18     // APResponse Register
#define MAX20303_REG_AP_DATAIN0          0x19
#define MAX20303_REG_AP_DATAIN1          0x1A
#define MAX20303_REG_AP_DATAIN2          0x1B
#define MAX20303_REG_AP_DATAIN3          0x1C
#define MAX20303_REG_AP_DATAIN4          0x1D
#define MAX20303_REG_AP_DATAIN5          0x1E
#define MAX20303_REG_LDO_DIRECT          0x20
#define MAX20303_REG_MPC_DIRECTWRITE     0x21
#define MAX20303_REG_MPC_DIRECTRED       0x22
#define MAX20303_REG_LED_STEP_DIRECT     0x2C
#define MAX20303_REG_LED0_DIRECT         0x2D
#define MAX20303_REG_LED1_DIRECT         0x2E
#define MAX20303_REG_LED2_DIRECT         0x2F
#define MAX20303_REG_LDO1_CONFIG_WRITE   0x40
#define MAX20303_REG_LDO1_CONFIG_READ    0x41
#define MAX20303_REG_LDO2_CONFIG_WRITE   0x42
#define MAX20303_REG_LDO2_CONFIG_READ    0x43

#define MAX20303_APREG_GPIO_CONFIG_WRITE                 0x01
#define MAX20303_APREG_GPIO_CONFIG_READ                  0x02
#define MAX20303_APREG_GPIO_CONTROL_WRITE                0x03
#define MAX20303_APREG_GPIO_CONTROL_READ                 0x04

#define MAX20303_APREG_MPC_CONFIG_WRITE                  0x06
#define MAX20303_APREG_MPC_CONFIG_READ                   0x07
#define MAX20303_APREG_INPUTCURRENT_CONFIG_WRITE         0x10
#define MAX20303_APREG_INPUTCURRENT_CONFIG_READ          0x11
#define MAX20303_APREG_THERMALSHUTDOWN_CONFIG_READ       0x12
#define MAX20303_APREG_CHARHER_CONFIG_WRITE              0x14
#define MAX20303_APREG_CHARHER_CONFIG_READ               0x15
#define MAX20303_APREG_CHARHER_CONTROL_WRITE             0x1A
#define MAX20303_APREG_CHARHER_CONTROL_READ              0x1B

#define MAX20303_APREG_BST_CONFIG_WRITE                  0x30
#define MAX20303_APREG_BST_CONFIG_READ                   0x31
#define MAX20303_APREG_BUCK1_CONFIG_WRITE                0x35
#define MAX20303_APREG_BUCK1_CONFIG_READ                 0x36
#define MAX20303_APREG_BUCK1_DVSCONFIG_WRITE             0x37
#define MAX20303_APREG_BUCK2_CONFIG_WRITE                0x3A
#define MAX20303_APREG_BUCK2_CONFIG_READ                 0x3B
#define MAX20303_APREG_BUCK2_DVSCONFIG_WRITE             0x3C
#define MAX20303_APREG_LDO1_CONFIG_WRITE                 0x40
#define MAX20303_APREG_LDO1_CONFIG_READ                  0x41
#define MAX20303_APREG_LDO2_CONFIG_WRITE                 0x42
#define MAX20303_APREG_LDO2_CONFIG_READ                  0x43
#define MAX20303_APREG_CHARGEPUMP_CONFIG_WRITE           0x46
#define MAX20303_APREG_CHARGEPUMP_CONFIG_READ            0x47
#define MAX20303_APREG_SFOUT_CONFIG_WRITE                0x48
#define MAX20303_APREG_SFOUT_CONFIG_READ                 0x49

#define MAX20303_APREG_BBST_CONFIG_WRITE                 0x70
#define MAX20303_APREG_BBST_CONFIG_READ                  0x71

#define MAX20303_APREG_POWEROFF                          0x80
#define MAX20303_APREG_SOFTRESET                         0x81
#define MAX20303_APREG_HARDRESET                         0x82
#define MAX20303_APREG_STAYON                            0x83
#define MAX20303_APREG_POWEROFF_COMMAND_DELAY            0x84


