analogdevicesinc/MAX78xxx-RefDes/maxrefdes178/maxrefdes178_max32666/src/max32666_pmic.c
//-----------------------------------------------------------------------------
// Global variables
//-----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
// Typedefs
//-----------------------------------------------------------------------------
enum eMax20303RegStatus0ChgStat
{
    MAX20303_STATUS0_CHG_STAT_OFF = 0x0,       /**< Charger off */
    MAX20303_STATUS0_CHG_STAT_SUSPENDED_TEMP,  /**< Charging suspended due to temperature */
    MAX20303_STATUS0_CHG_STAT_PRE_CHARGE,      /**< Pre-charge in progress */
    MAX20303_STATUS0_CHG_STAT_FAST_CHARGE_CC,  /**< Fast-charge constant current mode in progress */
    MAX20303_STATUS0_CHG_STAT_FAST_CHARGE_CV,  /**< Fast-charge constant voltage mode in progress */
    MAX20303_STATUS0_CHG_STAT_MAINTAIN,        /**< Maintain charge in progress */
    MAX20303_STATUS0_CHG_STAT_MAINTAIN_DONE,   /**< Maintain charger timer done */
    MAX20303_STATUS0_CHG_STAT_FAULT,           /**< Charger fault condition */
};

typedef union
{
    uint8_t raw;
    struct
    {
        uint8_t ChgStat    : 4;   /**< Status of Charger Mode. */
        uint8_t ThmStat    : 4;   /**< Status of Thermistor Monitoring. */
    } bits;
} tuMax20303RegStatus0;

typedef union
{
    uint8_t raw;
    struct
    {
        uint8_t ChgTmo     : 1;   /**< Status of Time-Out Condition. */
        uint8_t ChgThmReg  : 1;   /**< Status of Thermal Regulation. */
        uint8_t ChgThmSd   : 1;   /**< Status of Thermal Shutdown. */
        uint8_t UsbOk      : 1;   /**< Status of CHGIN Input. */
        uint8_t UsbOVP     : 1;   /**< Status of CHGIN OVP. */
        uint8_t ILim       : 1;   /**< CHGIN Input Current Limit. */
        uint8_t            : 2;
    } bits;
} tuMax20303RegStatus1;


//-----------------------------------------------------------------------------
// Local function declarations
//-----------------------------------------------------------------------------
static int pmic_enable_charger(void);


//-----------------------------------------------------------------------------
// Function definitions
//-----------------------------------------------------------------------------
int pmic_init(void)
{
    int err;
	uint8_t regval;

    // Test connectivity by reading hardware ID
    if ((err = i2c_master_reg_read(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_HARDWARE_ID, &regval)) != E_NO_ERROR) {
        PR_ERROR("i2c_reg_read failed %d", err);
        return err;
    }
    if (regval != MAX20303_HARDWARE_ID) {
        PR_ERROR("hw_id is not supported 0x%x", regval);
        return E_NOT_SUPPORTED;
    }

    // MAX20303J : Default configuration must modified for normal mode of operation
    // At Power-Up :
    // LOD1				is disabled , configured as LDO; Vout = 1.2V
    // LDO2				is disabled , configured as LDO; Vout = 3.2V
    // Buck1 converter	is enabled	, set to 1.8V
    // Buck2 converter	is disabled , set to 0.9V
    // Boost converter	is disabled , set to 20V

    // After Power-Up :
    // LDO1				configure as load-switch
    // LDO2				configure as LDO; Vout = 3.3V
    // Buck1 converter	set to 1.8V and enable
    // Buck2 converter	set to 2.8V and enable
    // Boost converter	set to 9.6V and enable when needed

    // Configure LDO and Buck outputs
    if ((err = pmic_ldo2(1)) != E_NO_ERROR) {
        PR_ERROR("max20303_ldo2 failed %d", err);
        return err;
    }
    MXC_Delay(MXC_DELAY_MSEC(10));

    // i2c bus lock issue fix
    i2c_master_init(MAX32666_I2C, I2C_SPEED);

    if ((err = pmic_buck2(0)) != E_NO_ERROR) {
        PR_ERROR("max20303_buck2 failed %d", err);
        return err;
    }
    MXC_Delay(MXC_DELAY_MSEC(100));

    if ((err = pmic_boost(0, 0x10)) != E_NO_ERROR) {
        PR_ERROR("max20303_boost failed %d", err);
        return err;
    }
    MXC_Delay(MXC_DELAY_MSEC(10));

    if ((err = pmic_ldo1(1)) != E_NO_ERROR) {
        PR_ERROR("max20303_ldo1 failed %d", err);
        return err;
    }
    MXC_Delay(MXC_DELAY_MSEC(10));

    if ((err = pmic_buck1(1)) != E_NO_ERROR) {
        PR_ERROR("max20303_buck1 failed %d", err);
        return err;
    }
    MXC_Delay(MXC_DELAY_MSEC(10));

    if ((err = pmic_buck2(1)) != E_NO_ERROR) {
        PR_ERROR("max20303_buck2 failed %d", err);
        return err;
    }
    MXC_Delay(MXC_DELAY_MSEC(100));

    // Turn off all PMIC LEDs at startup
    if ((err = pmic_led_red(0)) != E_NO_ERROR) {
        PR_ERROR("max20303_led_red failed %d", err);
        return err;
    }
    if ((err = pmic_led_blue(0)) != E_NO_ERROR) {
        PR_ERROR("max20303_led_blue failed %d", err);
        return err;
    }
    if ((err = pmic_led_green(0)) != E_NO_ERROR) {
        PR_ERROR("max20303_led_green failed %d", err);
        return err;
    }

    if ((err = pmic_enable_charger()) != E_NO_ERROR) {
        PR_ERROR("max20303_enable_charger failed %d", err);
        return err;
    }

    return E_NO_ERROR;
}

static int pmic_enable_charger(void)
{
    int err;
    uint8_t appdata[4];

    // write charger config
    // MAX20303J default is 0x0C, 0x75, 0xF6, 0x00
    appdata[0] = 0x0C;  // MtChgTmr=0min, FChgTmr=600min, PChgTmr=30min
    appdata[1] = 0x75;  // VPChg=3.15V, IPChg=0.1xIFChg, ChgDone=0.1xIFChg
    appdata[2] = 0xF3;  // ChgAutoStp=Auto-Stop enabled, ChgAutoRe=Auto-Restart enabled, BatReChg=BatReg-220mV, BatReg=4.20V
    appdata[3] = 0x00;  // SysMinVlt=3.6V
    if ((err = i2c_master_reg_write_buf(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT0, appdata, 4)) != E_NO_ERROR) {
        PR_ERROR("i2c_master_reg_write_buf failed %d", err);
        return err;
    }
    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_CMDOUT, MAX20303_APREG_CHARHER_CONFIG_WRITE)) != E_NO_ERROR) {
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    MXC_Delay(MXC_DELAY_MSEC(10));
    if ((err = i2c_master_reg_read_buf(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_RESPONSE, appdata, 1)) != E_NO_ERROR) {
        PR_ERROR("i2c_master_reg_read_buf failed %d", err);
        return err;
    }
    if (appdata[0] != MAX20303_APREG_CHARHER_CONFIG_WRITE) {
        PR_ERROR("incorrect response 0x%x", appdata[0]);
    }

    // write charger control
    // MAX20303J default is 0x00
    appdata[0] = 0x01;  // ThmEn=Thermal monitor disabled, ChgEn=Charger enabled
    if ((err = i2c_master_reg_write_buf(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT0, appdata, 1)) != E_NO_ERROR) {
        PR_ERROR("i2c_master_reg_write_buf failed %d", err);
        return err;
    }
    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_CMDOUT, MAX20303_APREG_CHARHER_CONTROL_WRITE)) != E_NO_ERROR) {
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    MXC_Delay(MXC_DELAY_MSEC(10));
    if ((err = i2c_master_reg_read_buf(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_RESPONSE, appdata, 1)) != E_NO_ERROR) {
        PR_ERROR("i2c_master_reg_read_buf failed %d", err);
        return err;
    }
    if (appdata[0] != MAX20303_APREG_CHARHER_CONTROL_WRITE) {
        PR_ERROR("incorrect response 0x%x", appdata[0]);
    }

//    // read charger config
//    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_CMDOUT, MAX20303_APREG_CHARHER_CONFIG_READ)) != E_NO_ERROR) {
//        PR_ERROR("i2c_master_reg_write failed %d", err);
//        return err;
//    }
//    MXC_Delay(MXC_DELAY_MSEC(5));
//    if ((err = i2c_master_reg_read_buf(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATAIN0, appdata, 4)) != E_NO_ERROR) {
//        PR_ERROR("i2c_master_reg_read_buf failed %d", err);
//        return err;
//    }
//    PR_DEBUG("charger config 0x%x 0x%x 0x%x 0x%x", appdata[0], appdata[1], appdata[2], appdata[3]);
//
//    // read charger control
//    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_CMDOUT, MAX20303_APREG_CHARHER_CONTROL_READ)) != E_NO_ERROR) {
//        PR_ERROR("i2c_master_reg_read_buf failed %d", err);
//        return err;
//    }
//    MXC_Delay(MXC_DELAY_MSEC(5));
//    if ((err = i2c_master_reg_read_buf(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATAIN0, appdata, 1)) != E_NO_ERROR) {
//        PR_ERROR("i2c_master_reg_read_buf failed %d", err);
//        return err;
//    }
//    PR_DEBUG("charger control 0x%x", appdata[0]);

    return E_NO_ERROR;
}

int pmic_worker(void)
{
    int err;

//    tuMax20303RegStatus0 lMax20303RegStatus0 = {0};
//    if ((err = i2c_master_reg_read(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_STATUS0, &lMax20303RegStatus0.raw)) != E_NO_ERROR) {
//        PR_ERROR("i2c_reg_read failed %d", err);
//        return err;
//    }

    tuMax20303RegStatus1 lMax20303RegStatus1 = {0};
    if ((err = i2c_master_reg_read(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_STATUS1, &lMax20303RegStatus1.raw)) != E_NO_ERROR) {
        PR_ERROR("i2c_reg_read failed %d", err);
        return err;
    }

//    switch (lMax20303RegStatus0.bits.ChgStat) {
//    case MAX20303_STATUS0_CHG_STAT_OFF:
//        PR_DEBUG("Charger off");
//        break;
//    case MAX20303_STATUS0_CHG_STAT_SUSPENDED_TEMP:
//        PR_DEBUG("Charging suspended due to temperature");
//        break;
//    case MAX20303_STATUS0_CHG_STAT_PRE_CHARGE:
//        PR_DEBUG("Pre-charge in progress");
//        break;
//    case MAX20303_STATUS0_CHG_STAT_FAST_CHARGE_CC:
//        PR_DEBUG("Fast-charge constant current mode in progress");
//        break;
//    case MAX20303_STATUS0_CHG_STAT_FAST_CHARGE_CV:
//        PR_DEBUG("Fast-charge constant voltage mode in progress");
//        break;
//    case MAX20303_STATUS0_CHG_STAT_MAINTAIN:
//        PR_DEBUG("Maintain charge in progress");
//        break;
//    case MAX20303_STATUS0_CHG_STAT_MAINTAIN_DONE:
//        PR_DEBUG("Maintain charger timer done");
//        break;
//    case MAX20303_STATUS0_CHG_STAT_FAULT:
//        PR_DEBUG("Charger fault condition");
//        break;
//    }

    if (lMax20303RegStatus1.bits.UsbOk) {
        if (!device_status.usb_chgin) {
            pmic_enable_charger();
        }
        device_status.usb_chgin = 1;
    } else {
        device_status.usb_chgin = 0;
    }

    return E_NO_ERROR;
}

int pmic_led_red(int on)
{
    int err;

    if (on) {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_LED1_DIRECT, 0x21)) != E_NO_ERROR) {
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }
    } else {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_LED1_DIRECT, 0x01)) != E_NO_ERROR) {
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }
    }
    return E_NO_ERROR;
}

int pmic_led_green(int on)
{
    int err;

    if (on) {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_LED2_DIRECT, 0x21)) != E_NO_ERROR) {
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }
    } else {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_LED2_DIRECT, 0x01)) != E_NO_ERROR) {
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }
    }
    return E_NO_ERROR;
}

