analogdevicesinc/MAX78xxx-RefDes/maxrefdes178/maxrefdes178_max32666/src/max32666_pmic.c
int pmic_led_blue(int on)
{
    int err;

    if (on) {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_LED0_DIRECT, 0x21)) != E_NO_ERROR) {
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }
    } else {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_LED0_DIRECT, 0x01)) != E_NO_ERROR) {
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }
    }
    return E_NO_ERROR;
}

int pmic_ldo1(int on)
{
    int err;

    if (on) {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT0, 0x1D)) != E_NO_ERROR) {  // LDO1Md:1 Load-switch mode.  LDO1En:01   Enabled
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }
    } else {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT0, 0x1C)) != E_NO_ERROR) {  // LDO1Md:1 Load-switch mode.  LDO1En:00   Disabled
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }
    }

    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT1, 0x34)) != E_NO_ERROR) {  // LDO1Vset : 0x34 = 52.  ( 52 * 25mv) + 0.5V = 1.8V
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_CMDOUT, MAX20303_APREG_LDO1_CONFIG_WRITE)) != E_NO_ERROR) {
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    return E_NO_ERROR;
}

int pmic_ldo2(int on)
{
    int err;
    if (on) {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT0, 0x19)) != E_NO_ERROR) {  // LDO2Md:0 LDO mode.  LDO2En:01   Enabled
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }
    } else {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT0, 0x18)) != E_NO_ERROR) {  // LDO2Md:0 LDO mode.  LDO2En:00   Disabled
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }
    }

    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT1, 0x18)) != E_NO_ERROR) {  // LDO2Vset : 0x18 = 24.  ( 24 * 100mv) + 0.9V = 3.3V
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_CMDOUT, MAX20303_APREG_LDO2_CONFIG_WRITE)) != E_NO_ERROR) {
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    return E_NO_ERROR;
}

int pmic_buck1(int on)
{
    int err;

    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT0, 0x7E)) != E_NO_ERROR) {
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT1, 0x28)) != E_NO_ERROR) {  // Buck1Vset = 0x28=40    ( (40x25mV) + 0.8V = 1.8V)
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT2, 0x1F)) != E_NO_ERROR) {  // Buck1Iset = 0b1111>375mA,  Buck1IZCSet=0b01>20mA   Buck1 ISet and Zero Crossing Threshold
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }

    if (on) {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT3, 0x01)) != E_NO_ERROR) {  // Buck1En = 1   Buck1 enabled
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }
    } else {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT3, 0x00)) != E_NO_ERROR) {  // Buck1En = 0   Buck1 disabled
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }
    }

    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_CMDOUT, MAX20303_APREG_BUCK1_CONFIG_WRITE)) != E_NO_ERROR) {
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    return E_NO_ERROR;
}

int pmic_buck2(int on)
{
    int err;

    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT0, 0x7E)) != E_NO_ERROR) {  // Enable active discharge and FET scaling
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT1, 0x28)) != E_NO_ERROR) {  // Buck2Vset = 0x28=40    ( (40x50mV) + 0.8V = 2.8V)
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT2, 0x2F)) != E_NO_ERROR) {  // Buck2Iset = 0b1111>375mA,  Buck2IZCSet=0b10>30mA   Buck2 ISet and Zero Crossing Threshold
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }

    if (on) {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT3, 0x01)) != E_NO_ERROR) {  // Buck2En = 1   Buck2 enabled
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }
    } else {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT3, 0x00)) != E_NO_ERROR) {  // Buck2En = 0   Buck2 disabled
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }

    }

    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_CMDOUT, MAX20303_APREG_BUCK2_CONFIG_WRITE)) != E_NO_ERROR) {
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    return E_NO_ERROR;
}

int pmic_buckboost(int on)
{
    int err;

    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT0, 0x00)) != E_NO_ERROR) {  //  Reserved. Set to 0x00
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT1, 0x07)) != E_NO_ERROR) {  //  BBstIset : 350mAa Max
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT2, 0x19)) != E_NO_ERROR) {  //  BBstVset = 0x19=25  ( ( 25 * 100mV) + 2.5V = 5.00V)
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }

    if (on) {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT3, 0x79)) != E_NO_ERROR) {  //  BuckBoost Enabled - BSTEn = 0x01
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }
    } else {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT3, 0x78)) != E_NO_ERROR) {  //  BuckBoost Disabled - BSTEn = 0x00
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }
    }

