analogdevicesinc/MAX78xxx-RefDes/maxrefdes178/maxrefdes178_max32666/src/max32666_pmic.c
    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_CMDOUT, MAX20303_APREG_BBST_CONFIG_WRITE)) != E_NO_ERROR) {  // = Bset_Config_Write
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    return E_NO_ERROR;
}

int pmic_boost(int on, uint8_t boost_output_level)
{
    int err;

    //  Prevent setting boost voltage above 10.5V due to specs limitation of the LCD
    if (boost_output_level > 0x16) {
        return E_BAD_PARAM;
    }

    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT3, boost_output_level)) != E_NO_ERROR) {  //  BstVset = 0x0F=15  ( ( 15 * 250mV) + 5 = 8.75V)
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }

    if (on) {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT0, 0x01)) != E_NO_ERROR) {  //  Boost Enabled - BSTEn = 0x01
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }
    } else {
        if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT0, 0x00)) != E_NO_ERROR) {  //  Boost Disabled - BSTEn = 0x00
            PR_ERROR("i2c_master_reg_write failed %d", err);
            return err;
        }
    }

    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT4, 0x03)) != E_NO_ERROR) {  //  BstSet 0x03 - not sure if this is writeable
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_CMDOUT, MAX20303_APREG_BST_CONFIG_WRITE)) != E_NO_ERROR) {  // = Bset_Config_Write
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    return E_NO_ERROR;
}

int pmic_power_off(void)
{
    int err;

    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT0, 0xB2)) != E_NO_ERROR) {
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_CMDOUT, MAX20303_APREG_POWEROFF)) != E_NO_ERROR) {
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    return E_NO_ERROR;
}

int pmic_hard_reset(void)
{
    int err;

    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_DATOUT0, 0xB4)) != E_NO_ERROR) {
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    if ((err = i2c_master_reg_write(MAX32666_I2C, I2C_ADDR_MAX20303_PMIC, MAX20303_REG_AP_CMDOUT, MAX20303_APREG_HARDRESET)) != E_NO_ERROR) {
        PR_ERROR("i2c_master_reg_write failed %d", err);
        return err;
    }
    return E_NO_ERROR;
}
